witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
#include "system_menu.h"
#include "lcd.h"
#include "settings.h"
#include "audio_filters.h"
#include "bootloader.h"
#include "functions.h"
#include "wifi.h"
#include "spec_analyzer.h"
#include "swr_analyzer.h"
#include "fonts.h"
#include "agc.h"
#include "screen_layout.h"
#include "noise_blanker.h"
#include "bands.h"
#include "sd.h"
#include "wspr.h"
#include "stm32h7xx_it.h"
#include "usbd_ua3reo.h"
#include "filemanager.h"
#include "rf_unit.h"

static void SYSMENU_HANDL_TRX_RFPower(int8_t direction);
static void SYSMENU_HANDL_TRX_BandMap(int8_t direction);
static void SYSMENU_HANDL_TRX_ChannelMode(int8_t direction);
static void SYSMENU_HANDL_TRX_AutoGain(int8_t direction);
static void SYSMENU_HANDL_TRX_TWO_SIGNAL_TUNE(int8_t direction);
static void SYSMENU_HANDL_TRX_RFFilters(int8_t direction);
static void SYSMENU_HANDL_TRX_INPUT_TYPE_MAIN(int8_t direction);
static void SYSMENU_HANDL_TRX_INPUT_TYPE_DIGI(int8_t direction);
static void SYSMENU_HANDL_TRX_SHIFT_INTERVAL(int8_t direction);
static void SYSMENU_HANDL_TRX_SAMPLERATE_MAIN(int8_t direction);
static void SYSMENU_HANDL_TRX_SAMPLERATE_FM(int8_t direction);
static void SYSMENU_HANDL_TRX_FRQ_STEP(int8_t direction);
static void SYSMENU_HANDL_TRX_FRQ_FAST_STEP(int8_t direction);
static void SYSMENU_HANDL_TRX_FRQ_ENC_STEP(int8_t direction);
static void SYSMENU_HANDL_TRX_FRQ_ENC_FAST_STEP(int8_t direction);
static void SYSMENU_HANDL_TRX_FRQ_CW_STEP_DIVIDER(int8_t direction);
static void SYSMENU_HANDL_TRX_ENC_ACCELERATE(int8_t direction);
static void SYSMENU_HANDL_TRX_ATT_STEP(int8_t direction);
static void SYSMENU_HANDL_TRX_DEBUG_TYPE(int8_t direction);
static void SYSMENU_HANDL_TRX_SetCallsign(int8_t direction);
static void SYSMENU_HANDL_TRX_SetLocator(int8_t direction);
static void SYSMENU_HANDL_TRX_TRANSV_ENABLE(int8_t direction);
static void SYSMENU_HANDL_TRX_TRANSV_OFFSET(int8_t direction);
static void SYSMENU_HANDL_TRX_ATU_I(int8_t direction);
static void SYSMENU_HANDL_TRX_ATU_C(int8_t direction);
static void SYSMENU_HANDL_TRX_ATU_T(int8_t direction);

static void SYSMENU_HANDL_AUDIO_IFGain(int8_t direction);
static void SYSMENU_HANDL_AUDIO_AGC_GAIN_TARGET(int8_t direction);
static void SYSMENU_HANDL_AUDIO_MIC_Gain(int8_t direction);
static void SYSMENU_HANDL_AUDIO_DNR1_THRES(int8_t direction);
static void SYSMENU_HANDL_AUDIO_DNR2_THRES(int8_t direction);
static void SYSMENU_HANDL_AUDIO_DNR_AVERAGE(int8_t direction);
static void SYSMENU_HANDL_AUDIO_DNR_MINMAL(int8_t direction);
static void SYSMENU_HANDL_AUDIO_SSB_HPF_pass(int8_t direction);
static void SYSMENU_HANDL_AUDIO_SSB_LPF_RX_pass(int8_t direction);
static void SYSMENU_HANDL_AUDIO_SSB_LPF_TX_pass(int8_t direction);
static void SYSMENU_HANDL_AUDIO_CW_LPF_pass(int8_t direction);
static void SYSMENU_HANDL_AUDIO_AM_LPF_RX_pass(int8_t direction);
static void SYSMENU_HANDL_AUDIO_AM_LPF_TX_pass(int8_t direction);
static void SYSMENU_HANDL_AUDIO_FM_LPF_RX_pass(int8_t direction);
static void SYSMENU_HANDL_AUDIO_FM_LPF_TX_pass(int8_t direction);
static void SYSMENU_HANDL_AUDIO_MIC_EQ_LOW_SSB(int8_t direction);
static void SYSMENU_HANDL_AUDIO_MIC_EQ_MID_SSB(int8_t direction);
static void SYSMENU_HANDL_AUDIO_MIC_EQ_HIG_SSB(int8_t direction);
static void SYSMENU_HANDL_AUDIO_MIC_EQ_LOW_AMFM(int8_t direction);
static void SYSMENU_HANDL_AUDIO_MIC_EQ_MID_AMFM(int8_t direction);
static void SYSMENU_HANDL_AUDIO_MIC_EQ_HIG_AMFM(int8_t direction);
static void SYSMENU_HANDL_AUDIO_MIC_REVERBER(int8_t direction);
static void SYSMENU_HANDL_AUDIO_RX_EQ_LOW(int8_t direction);
static void SYSMENU_HANDL_AUDIO_RX_EQ_MID(int8_t direction);
static void SYSMENU_HANDL_AUDIO_RX_EQ_HIG(int8_t direction);
static void SYSMENU_HANDL_AUDIO_RX_AGC_SSB_Speed(int8_t direction);
static void SYSMENU_HANDL_AUDIO_RX_AGC_CW_Speed(int8_t direction);
static void SYSMENU_HANDL_AUDIO_RX_AGC_Max_gain(int8_t direction);
static void SYSMENU_HANDL_AUDIO_RX_AGC_Hold(int8_t direction);
static void SYSMENU_HANDL_AUDIO_TX_CompressorSpeed_SSB(int8_t direction);
static void SYSMENU_HANDL_AUDIO_TX_CompressorSpeed_AMFM(int8_t direction);
static void SYSMENU_HANDL_AUDIO_TX_CompressorMaxGain_SSB(int8_t direction);
static void SYSMENU_HANDL_AUDIO_TX_CompressorMaxGain_AMFM(int8_t direction);
static void SYSMENU_HANDL_AUDIO_FMSquelch(int8_t direction);
static void SYSMENU_HANDL_AUDIO_Squelch(int8_t direction);
static void SYSMENU_HANDL_AUDIO_Beeper(int8_t direction);
static void SYSMENU_HANDL_AUDIO_CTCSS_Freq(int8_t direction);

static void SYSMENU_HANDL_CW_Pitch(int8_t direction);
static void SYSMENU_HANDL_CW_Decoder(int8_t direction);
static void SYSMENU_HANDL_CW_SelfHear(int8_t direction);
static void SYSMENU_HANDL_CW_Keyer(int8_t direction);
static void SYSMENU_HANDL_CW_Keyer_WPM(int8_t direction);
static void SYSMENU_HANDL_CW_Key_timeout(int8_t direction);
static void SYSMENU_HANDL_CW_GaussFilter(int8_t direction);

static void SYSMENU_HANDL_SCREEN_FFT_Enabled(int8_t direction);
static void SYSMENU_HANDL_SCREEN_COLOR_THEME(int8_t direction);
static void SYSMENU_HANDL_SCREEN_LAYOUT_THEME(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FFT_Averaging(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FFT_Window(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FFT_Zoom(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FFT_ZoomCW(int8_t direction);
static void SYSMENU_HANDL_SCREEN_LCD_Brightness(int8_t direction);
static void SYSMENU_HANDL_SCREEN_WTF_Moving(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FFT_Height(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FFT_Style(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FFT_Color(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FFT_Grid(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FFT_Background(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FFT_Speed(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FFT_Sensitivity(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FFT_Compressor(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FFT_Lens(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FFT_HoldPeaks(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FFT_3D(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FFT_Automatic(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FFT_ManualBottom(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FFT_ManualTop(int8_t direction);
static void SYSMENU_HANDL_SCREEN_RDS_Decoder(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON1(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON2(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON3(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON4(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON5(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON6(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON7(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON8(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON9(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON10(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON11(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON12(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON13(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON14(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON15(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON16(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON17(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON18(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON19(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON20(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON21(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON22(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON23(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON24(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON25(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON26(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON27(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON28(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON29(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON30(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON31(int8_t direction);
static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON32(int8_t direction);

static void SYSMENU_HANDL_ADC_PGA(int8_t direction);
static void SYSMENU_HANDL_ADC_RAND(int8_t direction);
static void SYSMENU_HANDL_ADC_SHDN(int8_t direction);
static void SYSMENU_HANDL_ADC_DITH(int8_t direction);
static void SYSMENU_HANDL_ADC_DRIVER(int8_t direction);

static void SYSMENU_HANDL_WIFI_Enabled(int8_t direction);
static void SYSMENU_HANDL_WIFI_SelectAP1(int8_t direction);
static void SYSMENU_HANDL_WIFI_SetAP1password(int8_t direction);
static void SYSMENU_HANDL_WIFI_SelectAP2(int8_t direction);
static void SYSMENU_HANDL_WIFI_SetAP2password(int8_t direction);
static void SYSMENU_HANDL_WIFI_SelectAP3(int8_t direction);
static void SYSMENU_HANDL_WIFI_SetAP3password(int8_t direction);
static void SYSMENU_HANDL_WIFI_Timezone(int8_t direction);
static void SYSMENU_HANDL_WIFI_CAT_Server(int8_t direction);
static void SYSMENU_HANDL_WIFI_UpdateFW(int8_t direction);

static void SYSMENU_HANDL_SD_Format(int8_t direction);
static void SYSMENU_HANDL_SD_ExportSettings(int8_t direction);
static void SYSMENU_HANDL_SD_ImportSettings(int8_t direction);
static void SYSMENU_HANDL_SD_USB(int8_t direction);

static void SYSMENU_HANDL_SETTIME(int8_t direction);
static void SYSMENU_HANDL_Bootloader(int8_t direction);
static void SYSMENU_HANDL_OTA_Update(int8_t direction);
static void SYSMENU_HANDL_SYSINFO(int8_t direction);

static void SYSMENU_HANDL_CALIB_ENCODER_SLOW_RATE(int8_t direction);
static void SYSMENU_HANDL_CALIB_ENCODER_INVERT(int8_t direction);
static void SYSMENU_HANDL_CALIB_ENCODER2_INVERT(int8_t direction);
static void SYSMENU_HANDL_CALIB_ENCODER_DEBOUNCE(int8_t direction);
static void SYSMENU_HANDL_CALIB_ENCODER2_DEBOUNCE(int8_t direction);
static void SYSMENU_HANDL_CALIB_ENCODER_ON_FALLING(int8_t direction);
static void SYSMENU_HANDL_CALIB_ENCODER_ACCELERATION(int8_t direction);
static void SYSMENU_HANDL_CALIB_RF_unit_type(int8_t direction);
static void SYSMENU_HANDL_CALIB_CICCOMP_48K_SHIFT(int8_t direction);
static void SYSMENU_HANDL_CALIB_CICCOMP_96K_SHIFT(int8_t direction);
static void SYSMENU_HANDL_CALIB_CICCOMP_192K_SHIFT(int8_t direction);
static void SYSMENU_HANDL_CALIB_CICCOMP_384K_SHIFT(int8_t direction);
static void SYSMENU_HANDL_CALIB_TXCICCOMP_SHIFT(int8_t direction);
static void SYSMENU_HANDL_CALIB_DAC_SHIFT(int8_t direction);
static void SYSMENU_HANDL_CALIB_RF_GAIN_2200M(int8_t direction);
static void SYSMENU_HANDL_CALIB_RF_GAIN_160M(int8_t direction);
static void SYSMENU_HANDL_CALIB_RF_GAIN_80M(int8_t direction);
static void SYSMENU_HANDL_CALIB_RF_GAIN_40M(int8_t direction);
static void SYSMENU_HANDL_CALIB_RF_GAIN_30M(int8_t direction);
static void SYSMENU_HANDL_CALIB_RF_GAIN_20M(int8_t direction);
static void SYSMENU_HANDL_CALIB_RF_GAIN_17M(int8_t direction);
static void SYSMENU_HANDL_CALIB_RF_GAIN_15M(int8_t direction);
static void SYSMENU_HANDL_CALIB_RF_GAIN_12M(int8_t direction);
static void SYSMENU_HANDL_CALIB_RF_GAIN_CB(int8_t direction);
static void SYSMENU_HANDL_CALIB_RF_GAIN_10M(int8_t direction);
static void SYSMENU_HANDL_CALIB_RF_GAIN_6M(int8_t direction);
static void SYSMENU_HANDL_CALIB_RF_GAIN_2M(int8_t direction);
static void SYSMENU_HANDL_CALIB_S_METER_HF(int8_t direction);
static void SYSMENU_HANDL_CALIB_S_METER_VHF(int8_t direction);
static void SYSMENU_HANDL_CALIB_ADC_OFFSET(int8_t direction);
static void SYSMENU_HANDL_CALIB_LPF_END(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_0_START(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_0_END(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_1_START(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_1_END(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_2_START(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_2_END(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_3_START(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_3_END(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_4_START(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_4_END(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_5_START(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_5_END(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_6_START(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_6_END(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_7_START(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_7_END(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_8_START(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_8_END(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_9_START(int8_t direction);
static void SYSMENU_HANDL_CALIB_BPF_9_END(int8_t direction);
static void SYSMENU_HANDL_CALIB_HPF_START(int8_t direction);
static void SYSMENU_HANDL_CALIB_MAX_RF_POWER(int8_t direction);
static void SYSMENU_HANDL_CALIB_SWR_FWD_RATE_HF(int8_t direction);
static void SYSMENU_HANDL_CALIB_SWR_REF_RATE_HF(int8_t direction);
static void SYSMENU_HANDL_CALIB_SWR_FWD_RATE_VHF(int8_t direction);
static void SYSMENU_HANDL_CALIB_SWR_REF_RATE_VHF(int8_t direction);
static void SYSMENU_HANDL_CALIB_VCXO(int8_t direction);
static void SYSMENU_HANDL_CALIB_FW_AD8307_SLP(int8_t direction);  //Tisho
static void SYSMENU_HANDL_CALIB_FW_AD8307_OFFS(int8_t direction); //Tisho
static void SYSMENU_HANDL_CALIB_BW_AD8307_SLP(int8_t direction);  //Tisho
static void SYSMENU_HANDL_CALIB_BW_AD8307_OFFS(int8_t direction); //Tisho
static void SYSMENU_HANDL_CALIB_FAN_MEDIUM_START(int8_t direction);
static void SYSMENU_HANDL_CALIB_FAN_MEDIUM_STOP(int8_t direction);
static void SYSMENU_HANDL_CALIB_FAN_FULL_START(int8_t direction);
static void SYSMENU_HANDL_CALIB_TRX_MAX_RF_TEMP(int8_t direction);
static void SYSMENU_HANDL_CALIB_TRX_MAX_SWR(int8_t direction);
static void SYSMENU_HANDL_CALIB_FM_DEVIATION_SCALE(int8_t direction);
static void SYSMENU_HANDL_CALIB_AM_MODULATION_INDEX(int8_t direction);
static void SYSMENU_HANDL_CALIB_TUNE_MAX_POWER(int8_t direction);
static void SYSMENU_HANDL_CALIB_RTC_COARSE_CALIBRATION(int8_t direction);
static void SYSMENU_HANDL_CALIB_RTC_CALIBRATION(int8_t direction);
static void SYSMENU_HANDL_CALIB_EXT_2200m(int8_t direction);
static void SYSMENU_HANDL_CALIB_EXT_160m(int8_t direction);
static void SYSMENU_HANDL_CALIB_EXT_80m(int8_t direction);
static void SYSMENU_HANDL_CALIB_EXT_60m(int8_t direction);
static void SYSMENU_HANDL_CALIB_EXT_40m(int8_t direction);
static void SYSMENU_HANDL_CALIB_EXT_30m(int8_t direction);
static void SYSMENU_HANDL_CALIB_EXT_20m(int8_t direction);
static void SYSMENU_HANDL_CALIB_EXT_17m(int8_t direction);
static void SYSMENU_HANDL_CALIB_EXT_15m(int8_t direction);
static void SYSMENU_HANDL_CALIB_EXT_12m(int8_t direction);
static void SYSMENU_HANDL_CALIB_EXT_CB(int8_t direction);
static void SYSMENU_HANDL_CALIB_EXT_10m(int8_t direction);
static void SYSMENU_HANDL_CALIB_EXT_6m(int8_t direction);
static void SYSMENU_HANDL_CALIB_EXT_FM(int8_t direction);
static void SYSMENU_HANDL_CALIB_EXT_2m(int8_t direction);
static void SYSMENU_HANDL_CALIB_EXT_70cm(int8_t direction);
static void SYSMENU_HANDL_CALIB_NOTX_NOTHAM(int8_t direction);
static void SYSMENU_HANDL_CALIB_NOTX_2200m(int8_t direction);
static void SYSMENU_HANDL_CALIB_NOTX_160m(int8_t direction);
static void SYSMENU_HANDL_CALIB_NOTX_80m(int8_t direction);
static void SYSMENU_HANDL_CALIB_NOTX_60m(int8_t direction);
static void SYSMENU_HANDL_CALIB_NOTX_40m(int8_t direction);
static void SYSMENU_HANDL_CALIB_NOTX_30m(int8_t direction);
static void SYSMENU_HANDL_CALIB_NOTX_20m(int8_t direction);
static void SYSMENU_HANDL_CALIB_NOTX_17m(int8_t direction);
static void SYSMENU_HANDL_CALIB_NOTX_15m(int8_t direction);
static void SYSMENU_HANDL_CALIB_NOTX_12m(int8_t direction);
static void SYSMENU_HANDL_CALIB_NOTX_CB(int8_t direction);
static void SYSMENU_HANDL_CALIB_NOTX_10m(int8_t direction);
static void SYSMENU_HANDL_CALIB_NOTX_6m(int8_t direction);
static void SYSMENU_HANDL_CALIB_NOTX_FM(int8_t direction);
static void SYSMENU_HANDL_CALIB_NOTX_2m(int8_t direction);
static void SYSMENU_HANDL_CALIB_NOTX_70cm(int8_t direction);
static void SYSMENU_HANDL_CALIB_ENABLE_60m_band(int8_t direction);
static void SYSMENU_HANDL_CALIB_ENABLE_marine_band(int8_t direction);
static void SYSMENU_HANDL_CALIB_OTA_update(int8_t direction);
static void SYSMENU_HANDL_CALIB_TX_StartDelay(int8_t direction);

static void SYSMENU_HANDL_SPECTRUM_Begin(int8_t direction);
static void SYSMENU_HANDL_SPECTRUM_Start(int8_t direction);
static void SYSMENU_HANDL_SPECTRUM_End(int8_t direction);
static void SYSMENU_HANDL_SPECTRUM_TopDBM(int8_t direction);
static void SYSMENU_HANDL_SPECTRUM_BottomDBM(int8_t direction);

static void SYSMENU_HANDL_WSPR_Start(int8_t direction);
static void SYSMENU_HANDL_WSPR_FREQ_OFFSET(int8_t direction);
static void SYSMENU_HANDL_WSPR_BAND160(int8_t direction);
static void SYSMENU_HANDL_WSPR_BAND80(int8_t direction);
static void SYSMENU_HANDL_WSPR_BAND40(int8_t direction);
static void SYSMENU_HANDL_WSPR_BAND30(int8_t direction);
static void SYSMENU_HANDL_WSPR_BAND20(int8_t direction);
static void SYSMENU_HANDL_WSPR_BAND17(int8_t direction);
static void SYSMENU_HANDL_WSPR_BAND15(int8_t direction);
static void SYSMENU_HANDL_WSPR_BAND12(int8_t direction);
static void SYSMENU_HANDL_WSPR_BAND10(int8_t direction);
static void SYSMENU_HANDL_WSPR_BAND6(int8_t direction);
static void SYSMENU_HANDL_WSPR_BAND2(int8_t direction);

