witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_AUDIO_TX_CompressorSpeed_SSB(int8_t direction)
{
	TRX.TX_Compressor_speed_SSB += direction;
	if (TRX.TX_Compressor_speed_SSB < 1)
		TRX.TX_Compressor_speed_SSB = 1;
	if (TRX.TX_Compressor_speed_SSB > 200)
		TRX.TX_Compressor_speed_SSB = 200;
}

static void SYSMENU_HANDL_AUDIO_TX_CompressorSpeed_AMFM(int8_t direction)
{
	TRX.TX_Compressor_speed_AMFM += direction;
	if (TRX.TX_Compressor_speed_AMFM < 1)
		TRX.TX_Compressor_speed_AMFM = 1;
	if (TRX.TX_Compressor_speed_AMFM > 200)
		TRX.TX_Compressor_speed_AMFM = 200;
}

static void SYSMENU_HANDL_AUDIO_TX_CompressorMaxGain_SSB(int8_t direction)
{
	TRX.TX_Compressor_maxgain_SSB += direction;
	if (TRX.TX_Compressor_maxgain_SSB < 1)
		TRX.TX_Compressor_maxgain_SSB = 1;
	if (TRX.TX_Compressor_maxgain_SSB > 10)
		TRX.TX_Compressor_maxgain_SSB = 10;
}

static void SYSMENU_HANDL_AUDIO_TX_CompressorMaxGain_AMFM(int8_t direction)
{
	TRX.TX_Compressor_maxgain_AMFM += direction;
	if (TRX.TX_Compressor_maxgain_AMFM < 1)
		TRX.TX_Compressor_maxgain_AMFM = 1;
	if (TRX.TX_Compressor_maxgain_AMFM > 10)
		TRX.TX_Compressor_maxgain_AMFM = 10;
}

static void SYSMENU_HANDL_AUDIO_FMSquelch(int8_t direction)
{
	if (direction < 0 && CurrentVFO->FM_SQL_threshold == 0)
		return;
	CurrentVFO->FM_SQL_threshold += direction;
	if (CurrentVFO->FM_SQL_threshold > 10)
		CurrentVFO->FM_SQL_threshold = 10;
	TRX.FM_SQL_threshold_shadow = CurrentVFO->FM_SQL_threshold;

	int8_t band = getBandFromFreq(CurrentVFO->Freq, true);
	if (band > 0)
		TRX.BANDS_SAVED_SETTINGS[band].FM_SQL_threshold = CurrentVFO->FM_SQL_threshold;
}

static void SYSMENU_HANDL_AUDIO_Squelch(int8_t direction)
{
	if (direction > 0)
		CurrentVFO->SQL = true;
	if (direction < 0)
		CurrentVFO->SQL = false;
	TRX.SQL_shadow = CurrentVFO->SQL;
	
	int8_t band = getBandFromFreq(CurrentVFO->Freq, true);
	if (band > 0)
		TRX.BANDS_SAVED_SETTINGS[band].SQL = CurrentVFO->SQL;
}

static void SYSMENU_HANDL_AUDIO_SSB_HPF_pass(int8_t direction)
{
	if (TRX.SSB_HPF_Filter > 0 || direction > 0)
		TRX.SSB_HPF_Filter += direction * 50;
	if(TRX.SSB_HPF_Filter > MAX_HPF_WIDTH)
		TRX.SSB_HPF_Filter = MAX_HPF_WIDTH;
	
	TRX_setMode(SecondaryVFO->Mode, SecondaryVFO);
	TRX_setMode(CurrentVFO->Mode, CurrentVFO);
}

static void SYSMENU_HANDL_AUDIO_CW_LPF_pass(int8_t direction)
{
	if (TRX.CW_LPF_Filter > 50 || direction > 0)
		TRX.CW_LPF_Filter += direction * 50;
	if(TRX.CW_LPF_Filter > MAX_LPF_WIDTH_CW)
		TRX.CW_LPF_Filter = MAX_LPF_WIDTH_CW;

	TRX_setMode(SecondaryVFO->Mode, SecondaryVFO);
	TRX_setMode(CurrentVFO->Mode, CurrentVFO);
}

static void SYSMENU_HANDL_AUDIO_SSB_LPF_RX_pass(int8_t direction)
{
	if (TRX.SSB_LPF_RX_Filter > 100 || direction > 0)
		TRX.SSB_LPF_RX_Filter += direction * 100;
	if(TRX.SSB_LPF_RX_Filter > MAX_LPF_WIDTH_SSB)
		TRX.SSB_LPF_RX_Filter = MAX_LPF_WIDTH_SSB;

	TRX_setMode(SecondaryVFO->Mode, SecondaryVFO);
	TRX_setMode(CurrentVFO->Mode, CurrentVFO);
}

static void SYSMENU_HANDL_AUDIO_SSB_LPF_TX_pass(int8_t direction)
{
	if (TRX.SSB_LPF_TX_Filter > 100 || direction > 0)
		TRX.SSB_LPF_TX_Filter += direction * 100;
	if(TRX.SSB_LPF_TX_Filter > MAX_LPF_WIDTH_SSB)
		TRX.SSB_LPF_TX_Filter = MAX_LPF_WIDTH_SSB;

	TRX_setMode(SecondaryVFO->Mode, SecondaryVFO);
	TRX_setMode(CurrentVFO->Mode, CurrentVFO);
}

static void SYSMENU_HANDL_AUDIO_AM_LPF_RX_pass(int8_t direction)
{
	if (TRX.AM_LPF_RX_Filter > 100 || direction > 0)
		TRX.AM_LPF_RX_Filter += direction * 100;
	if(TRX.AM_LPF_RX_Filter > MAX_LPF_WIDTH_AM)
		TRX.AM_LPF_RX_Filter = MAX_LPF_WIDTH_AM;

	TRX_setMode(SecondaryVFO->Mode, SecondaryVFO);
	TRX_setMode(CurrentVFO->Mode, CurrentVFO);
}

static void SYSMENU_HANDL_AUDIO_AM_LPF_TX_pass(int8_t direction)
{
	if (TRX.AM_LPF_TX_Filter > 100 || direction > 0)
		TRX.AM_LPF_TX_Filter += direction * 100;
	if(TRX.AM_LPF_TX_Filter > MAX_LPF_WIDTH_AM)
		TRX.AM_LPF_TX_Filter = MAX_LPF_WIDTH_AM;
	
	TRX_setMode(SecondaryVFO->Mode, SecondaryVFO);
	TRX_setMode(CurrentVFO->Mode, CurrentVFO);
}

static void SYSMENU_HANDL_AUDIO_FM_LPF_RX_pass(int8_t direction)
{
	if (TRX.FM_LPF_RX_Filter > 1000 || direction > 0)
		TRX.FM_LPF_RX_Filter += direction * 1000;
	if(TRX.FM_LPF_RX_Filter > MAX_LPF_WIDTH_NFM)
		TRX.FM_LPF_RX_Filter = MAX_LPF_WIDTH_NFM;
	
	TRX_setMode(SecondaryVFO->Mode, SecondaryVFO);
	TRX_setMode(CurrentVFO->Mode, CurrentVFO);
}

static void SYSMENU_HANDL_AUDIO_FM_LPF_TX_pass(int8_t direction)
{
	if (TRX.FM_LPF_TX_Filter > 1000 || direction > 0)
		TRX.FM_LPF_TX_Filter += direction * 1000;
	if(TRX.FM_LPF_TX_Filter > MAX_LPF_WIDTH_NFM)
		TRX.FM_LPF_TX_Filter = MAX_LPF_WIDTH_NFM;

	TRX_setMode(SecondaryVFO->Mode, SecondaryVFO);
	TRX_setMode(CurrentVFO->Mode, CurrentVFO);
}

static void SYSMENU_HANDL_AUDIO_Beeper(int8_t direction)
{
	if (direction > 0)
		TRX.Beeper = true;
	if (direction < 0)
		TRX.Beeper = false;
}

static void SYSMENU_HANDL_AUDIO_CTCSS_Freq(int8_t direction)
{
	uint16_t current_pos = 0;
	for(uint16_t i = 0; i < CTCSS_FREQS_COUNT; i++)
		if(CTCSS_Freqs[i] == TRX.CTCSS_Freq)
			current_pos = i;
	if(direction > 0)
		current_pos++;
	if(direction < 0 && current_pos > 0)
		current_pos--;
	if(current_pos >= CTCSS_FREQS_COUNT)
		current_pos = CTCSS_FREQS_COUNT - 1;
	TRX.CTCSS_Freq = CTCSS_Freqs[current_pos];
}

//CW MENU

static void SYSMENU_HANDL_CWMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_cw_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_cw_handlers) / sizeof(sysmenu_cw_handlers[0]);
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_redraw(false);
}

void SYSMENU_CW_WPM_HOTKEY(void)
{
	SYSMENU_HANDL_CWMENU(0);
	systemMenuIndex = 4;
	LCD_redraw(false);
}

void SYSMENU_CW_KEYER_HOTKEY(void)
{
	SYSMENU_HANDL_CWMENU(0);
	systemMenuIndex = 3;
	LCD_redraw(false);
}

static void SYSMENU_HANDL_CW_Decoder(int8_t direction)
{
	if (direction > 0)
		TRX.CWDecoderEnabled = true;
	if (direction < 0)
		TRX.CWDecoderEnabled = false;
}

static void SYSMENU_HANDL_CW_Pitch(int8_t direction)
{
	TRX.CW_Pitch += direction * 10;
	if (TRX.CW_Pitch < 50)
		TRX.CW_Pitch = 50;
	if (TRX.CW_Pitch > 10000)
		TRX.CW_Pitch = 10000;
}

static void SYSMENU_HANDL_CW_Key_timeout(int8_t direction)
{
	TRX.CW_Key_timeout += direction * 50;
	if (TRX.CW_Key_timeout < 50)
		TRX.CW_Key_timeout = 50;
	if (TRX.CW_Key_timeout > 5000)
		TRX.CW_Key_timeout = 5000;
}

