witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_CW_Keyer(int8_t direction)
{
	if (direction > 0)
		TRX.CW_KEYER = true;
	if (direction < 0)
		TRX.CW_KEYER = false;
}

static void SYSMENU_HANDL_CW_GaussFilter(int8_t direction)
{
	if (direction > 0)
		TRX.CW_GaussFilter = true;
	if (direction < 0)
		TRX.CW_GaussFilter = false;
	NeedReinitAudioFilters = true;
}

static void SYSMENU_HANDL_CW_Keyer_WPM(int8_t direction)
{
	TRX.CW_KEYER_WPM += direction;
	if (TRX.CW_KEYER_WPM < 1)
		TRX.CW_KEYER_WPM = 1;
	if (TRX.CW_KEYER_WPM > 200)
		TRX.CW_KEYER_WPM = 200;
}

static void SYSMENU_HANDL_CW_SelfHear(int8_t direction)
{
	if (direction > 0)
		TRX.CW_SelfHear = true;
	if (direction < 0)
		TRX.CW_SelfHear = false;
}

//SCREEN MENU

static void SYSMENU_HANDL_LCDMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_screen_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_screen_handlers) / sizeof(sysmenu_screen_handlers[0]);
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_SCREEN_FFT_Enabled(int8_t direction)
{
	if (direction > 0)
		TRX.FFT_Enabled = true;
	if (direction < 0)
		TRX.FFT_Enabled = false;
}

static void SYSMENU_HANDL_SCREEN_COLOR_THEME(int8_t direction)
{
	if (direction > 0 || TRX.ColorThemeId > 0)
		TRX.ColorThemeId += direction;
	if (TRX.ColorThemeId > (COLOR_THEMES_COUNT - 1))
		TRX.ColorThemeId = (COLOR_THEMES_COUNT - 1);

	COLOR = &COLOR_THEMES[TRX.ColorThemeId];
	FFT_Init();
	LCD_redraw(false);
}

static void SYSMENU_HANDL_SCREEN_LAYOUT_THEME(int8_t direction)
{
	if (direction > 0 || TRX.LayoutThemeId > 0)
		TRX.LayoutThemeId += direction;
	if (TRX.LayoutThemeId > (LAYOUT_THEMES_COUNT - 1))
		TRX.LayoutThemeId = (LAYOUT_THEMES_COUNT - 1);

	LAYOUT = &LAYOUT_THEMES[TRX.LayoutThemeId];
	FFT_Init();
	LCD_redraw(false);
}

static void SYSMENU_HANDL_SCREEN_FFT_Compressor(int8_t direction)
{
	if (direction > 0)
		TRX.FFT_Compressor = true;
	if (direction < 0)
		TRX.FFT_Compressor = false;
}

static void SYSMENU_HANDL_SCREEN_FFT_Averaging(int8_t direction)
{
	TRX.FFT_Averaging += direction;
	if (TRX.FFT_Averaging < 1)
		TRX.FFT_Averaging = 1;
	if (TRX.FFT_Averaging > FFT_MAX_MEANS)
		TRX.FFT_Averaging = FFT_MAX_MEANS;
}

static void SYSMENU_HANDL_SCREEN_FFT_Window(int8_t direction)
{
	TRX.FFT_Window += direction;
	if (TRX.FFT_Window < 1)
		TRX.FFT_Window = 1;
	if (TRX.FFT_Window > 7)
		TRX.FFT_Window = 7;
	FFT_PreInit();
	FFT_Init();
}

static void SYSMENU_HANDL_SCREEN_FFT_Zoom(int8_t direction)
{
	if (direction > 0)
	{
		if (TRX.FFT_Zoom == 1)
			TRX.FFT_Zoom = 2;
		else if (TRX.FFT_Zoom == 2)
			TRX.FFT_Zoom = 4;
		else if (TRX.FFT_Zoom == 4)
			TRX.FFT_Zoom = 8;
		else if (TRX.FFT_Zoom == 8)
			TRX.FFT_Zoom = 16;
	}
	else
	{
		if (TRX.FFT_Zoom == 2)
			TRX.FFT_Zoom = 1;
		else if (TRX.FFT_Zoom == 4)
			TRX.FFT_Zoom = 2;
		else if (TRX.FFT_Zoom == 8)
			TRX.FFT_Zoom = 4;
		else if (TRX.FFT_Zoom == 16)
			TRX.FFT_Zoom = 8;
	}
	FFT_Init();
}

static void SYSMENU_HANDL_SCREEN_FFT_ZoomCW(int8_t direction)
{
	if (direction > 0)
	{
		if (TRX.FFT_ZoomCW == 1)
			TRX.FFT_ZoomCW = 2;
		else if (TRX.FFT_ZoomCW == 2)
			TRX.FFT_ZoomCW = 4;
		else if (TRX.FFT_ZoomCW == 4)
			TRX.FFT_ZoomCW = 8;
		else if (TRX.FFT_ZoomCW == 8)
			TRX.FFT_ZoomCW = 16;
	}
	else
	{
		if (TRX.FFT_ZoomCW == 2)
			TRX.FFT_ZoomCW = 1;
		else if (TRX.FFT_ZoomCW == 4)
			TRX.FFT_ZoomCW = 2;
		else if (TRX.FFT_ZoomCW == 8)
			TRX.FFT_ZoomCW = 4;
		else if (TRX.FFT_ZoomCW == 16)
			TRX.FFT_ZoomCW = 8;
	}
	FFT_Init();
}

static void SYSMENU_HANDL_SCREEN_FFT_Height(int8_t direction)
{
	TRX.FFT_Height += direction;
	if (TRX.FFT_Height < 1)
		TRX.FFT_Height = 1;
	if (TRX.FFT_Height > 5)
		TRX.FFT_Height = 5;
	FFT_Init();
}

static void SYSMENU_HANDL_SCREEN_FFT_Style(int8_t direction)
{
	TRX.FFT_Style += direction;
	if (TRX.FFT_Style < 1)
		TRX.FFT_Style = 1;
	if (TRX.FFT_Style > 4)
		TRX.FFT_Style = 4;
	FFT_Init();
}

static void SYSMENU_HANDL_SCREEN_FFT_Color(int8_t direction)
{
	TRX.FFT_Color += direction;
	if (TRX.FFT_Color < 1)
		TRX.FFT_Color = 1;
	if (TRX.FFT_Color > 7)
		TRX.FFT_Color = 7;
	FFT_Init();
}

static void SYSMENU_HANDL_SCREEN_FFT_Grid(int8_t direction)
{
	TRX.FFT_Grid += direction;
	if (TRX.FFT_Grid < 0)
		TRX.FFT_Grid = 0;
	if (TRX.FFT_Grid > 3)
		TRX.FFT_Grid = 3;
	FFT_Init();
}

static void SYSMENU_HANDL_SCREEN_WTF_Moving(int8_t direction)
{
	if (direction > 0)
		TRX.WTF_Moving = true;
	if (direction < 0)
		TRX.WTF_Moving = false;
}

static void SYSMENU_HANDL_SCREEN_RDS_Decoder(int8_t direction)
{
	if (direction > 0)
		TRX.RDS_Decoder = true;
	if (direction < 0)
		TRX.RDS_Decoder = false;
}

static void SYSMENU_HANDL_SCREEN_FFT_Background(int8_t direction)
{
	if (direction > 0)
		TRX.FFT_Background = true;
	if (direction < 0)
		TRX.FFT_Background = false;
}

static void SYSMENU_HANDL_SCREEN_FFT_Lens(int8_t direction)
{
	if (direction > 0)
		TRX.FFT_Lens = true;
	if (direction < 0)
		TRX.FFT_Lens = false;
}

static void SYSMENU_HANDL_SCREEN_FFT_HoldPeaks(int8_t direction)
{
	if (direction > 0)
		TRX.FFT_HoldPeaks = true;
	if (direction < 0)
		TRX.FFT_HoldPeaks = false;
}

static void SYSMENU_HANDL_SCREEN_LCD_Brightness(int8_t direction)
{
	TRX.LCD_Brightness += direction;
	if (TRX.LCD_Brightness < 1)
		TRX.LCD_Brightness = 1;
	if (TRX.LCD_Brightness > 100)
		TRX.LCD_Brightness = 100;
	LCDDriver_setBrightness(TRX.LCD_Brightness);
}

static void SYSMENU_HANDL_SCREEN_FFT_3D(int8_t direction)
{
	TRX.FFT_3D += direction;
	if (TRX.FFT_3D > 2)
		TRX.FFT_3D = 2;
}

static void SYSMENU_HANDL_SCREEN_FFT_Automatic(int8_t direction)
{
	if (direction > 0)
		TRX.FFT_Automatic = true;
	if (direction < 0)
		TRX.FFT_Automatic = false;
}

static void SYSMENU_HANDL_SCREEN_FFT_ManualBottom(int8_t direction)
{
	TRX.FFT_ManualBottom += direction;
	if (TRX.FFT_ManualBottom < -150)
		TRX.FFT_ManualBottom = -150;
	if (TRX.FFT_ManualBottom > 50)
		TRX.FFT_ManualBottom = 50;
}

static void SYSMENU_HANDL_SCREEN_FFT_ManualTop(int8_t direction)
{
	TRX.FFT_ManualTop += direction;
	if (TRX.FFT_ManualTop < -150)
		TRX.FFT_ManualTop = -150;
	if (TRX.FFT_ManualTop > 50)
		TRX.FFT_ManualTop = 50;
}

