witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_SCREEN_FFT_Speed(int8_t direction)
{
	TRX.FFT_Speed += direction;
	if (TRX.FFT_Speed < 1)
		TRX.FFT_Speed = 1;
	if (TRX.FFT_Speed > 5)
		TRX.FFT_Speed = 5;
}

static void SYSMENU_HANDL_SCREEN_FFT_Sensitivity(int8_t direction)
{
	TRX.FFT_Sensitivity += direction;
	if (TRX.FFT_Sensitivity < FFT_MIN + 1)
		TRX.FFT_Sensitivity = FFT_MIN + 1;
	if (TRX.FFT_Sensitivity > FFT_MAX_TOP_SCALE)
		TRX.FFT_Sensitivity = FFT_MAX_TOP_SCALE;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON1(int8_t direction)
{
	if (TRX.FuncButtons[0] > 0 || direction > 0)
		TRX.FuncButtons[0] += direction;
	if (TRX.FuncButtons[0] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[0] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON2(int8_t direction)
{
	if (TRX.FuncButtons[1] > 0 || direction > 0)
		TRX.FuncButtons[1] += direction;
	if (TRX.FuncButtons[1] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[1] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON3(int8_t direction)
{
	if (TRX.FuncButtons[2] > 0 || direction > 0)
		TRX.FuncButtons[2] += direction;
	if (TRX.FuncButtons[2] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[2] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON4(int8_t direction)
{
	if (TRX.FuncButtons[3] > 0 || direction > 0)
		TRX.FuncButtons[3] += direction;
	if (TRX.FuncButtons[3] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[3] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON5(int8_t direction)
{
	if (TRX.FuncButtons[4] > 0 || direction > 0)
		TRX.FuncButtons[4] += direction;
	if (TRX.FuncButtons[4] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[4] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON6(int8_t direction)
{
	if (TRX.FuncButtons[5] > 0 || direction > 0)
		TRX.FuncButtons[5] += direction;
	if (TRX.FuncButtons[5] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[5] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON7(int8_t direction)
{
	if (TRX.FuncButtons[6] > 0 || direction > 0)
		TRX.FuncButtons[6] += direction;
	if (TRX.FuncButtons[6] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[6] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON8(int8_t direction)
{
	if (TRX.FuncButtons[7] > 0 || direction > 0)
		TRX.FuncButtons[7] += direction;
	if (TRX.FuncButtons[7] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[7] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON9(int8_t direction)
{
	if (TRX.FuncButtons[8] > 0 || direction > 0)
		TRX.FuncButtons[8] += direction;
	if (TRX.FuncButtons[8] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[8] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON10(int8_t direction)
{
	if (TRX.FuncButtons[9] > 0 || direction > 0)
		TRX.FuncButtons[9] += direction;
	if (TRX.FuncButtons[9] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[9] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON11(int8_t direction)
{
	if (TRX.FuncButtons[10] > 0 || direction > 0)
		TRX.FuncButtons[10] += direction;
	if (TRX.FuncButtons[10] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[10] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON12(int8_t direction)
{
	if (TRX.FuncButtons[11] > 0 || direction > 0)
		TRX.FuncButtons[11] += direction;
	if (TRX.FuncButtons[11] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[11] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON13(int8_t direction)
{
	if (TRX.FuncButtons[12] > 0 || direction > 0)
		TRX.FuncButtons[12] += direction;
	if (TRX.FuncButtons[12] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[12] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON14(int8_t direction)
{
	if (TRX.FuncButtons[13] > 0 || direction > 0)
		TRX.FuncButtons[13] += direction;
	if (TRX.FuncButtons[13] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[13] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON15(int8_t direction)
{
	if (TRX.FuncButtons[14] > 0 || direction > 0)
		TRX.FuncButtons[14] += direction;
	if (TRX.FuncButtons[14] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[14] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON16(int8_t direction)
{
	if (TRX.FuncButtons[15] > 0 || direction > 0)
		TRX.FuncButtons[15] += direction;
	if (TRX.FuncButtons[15] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[15] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON17(int8_t direction)
{
	if (TRX.FuncButtons[16] > 0 || direction > 0)
		TRX.FuncButtons[16] += direction;
	if (TRX.FuncButtons[16] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[16] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON18(int8_t direction)
{
	if (TRX.FuncButtons[17] > 0 || direction > 0)
		TRX.FuncButtons[17] += direction;
	if (TRX.FuncButtons[17] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[17] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON19(int8_t direction)
{
	if (TRX.FuncButtons[18] > 0 || direction > 0)
		TRX.FuncButtons[18] += direction;
	if (TRX.FuncButtons[18] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[18] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON20(int8_t direction)
{
	if (TRX.FuncButtons[19] > 0 || direction > 0)
		TRX.FuncButtons[19] += direction;
	if (TRX.FuncButtons[19] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[19] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON21(int8_t direction)
{
	if (TRX.FuncButtons[20] > 0 || direction > 0)
		TRX.FuncButtons[20] += direction;
	if (TRX.FuncButtons[20] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[20] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON22(int8_t direction)
{
	if (TRX.FuncButtons[21] > 0 || direction > 0)
		TRX.FuncButtons[21] += direction;
	if (TRX.FuncButtons[21] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[21] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON23(int8_t direction)
{
	if (TRX.FuncButtons[22] > 0 || direction > 0)
		TRX.FuncButtons[22] += direction;
	if (TRX.FuncButtons[22] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[22] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON24(int8_t direction)
{
	if (TRX.FuncButtons[23] > 0 || direction > 0)
		TRX.FuncButtons[23] += direction;
	if (TRX.FuncButtons[23] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[23] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON25(int8_t direction)
{
	if (TRX.FuncButtons[24] > 0 || direction > 0)
		TRX.FuncButtons[24] += direction;
	if (TRX.FuncButtons[24] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[24] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON26(int8_t direction)
{
	if (TRX.FuncButtons[25] > 0 || direction > 0)
		TRX.FuncButtons[25] += direction;
	if (TRX.FuncButtons[25] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[25] = FUNCBUTTONS_COUNT - 1;
}

static void SYSMENU_HANDL_SCREEN_FUNC_BUTTON27(int8_t direction)
{
	if (TRX.FuncButtons[26] > 0 || direction > 0)
		TRX.FuncButtons[26] += direction;
	if (TRX.FuncButtons[26] >= FUNCBUTTONS_COUNT)
		TRX.FuncButtons[26] = FUNCBUTTONS_COUNT - 1;
}

