witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_CALIB_ENCODER_SLOW_RATE(int8_t direction)
{
	CALIBRATE.ENCODER_SLOW_RATE += direction;
	if (CALIBRATE.ENCODER_SLOW_RATE < 1)
		CALIBRATE.ENCODER_SLOW_RATE = 1;
	if (CALIBRATE.ENCODER_SLOW_RATE > 100)
		CALIBRATE.ENCODER_SLOW_RATE = 100;
}

static void SYSMENU_HANDL_CALIB_ENCODER_ON_FALLING(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.ENCODER_ON_FALLING = true;
	if (direction < 0)
		CALIBRATE.ENCODER_ON_FALLING = false;
}

static void SYSMENU_HANDL_CALIB_ENCODER_ACCELERATION(int8_t direction)
{
	CALIBRATE.ENCODER_ACCELERATION += direction;
	if (CALIBRATE.ENCODER_ACCELERATION < 1)
		CALIBRATE.ENCODER_ACCELERATION = 1;
	if (CALIBRATE.ENCODER_ACCELERATION > 250)
		CALIBRATE.ENCODER_ACCELERATION = 250;
}

static void SYSMENU_HANDL_CALIB_RF_unit_type(int8_t direction)
{
	if(CALIBRATE.RF_unit_type > 0 || direction > 0)
		CALIBRATE.RF_unit_type += direction;
	if (CALIBRATE.RF_unit_type > 1)
		CALIBRATE.RF_unit_type = 1;
	
	if(CALIBRATE.RF_unit_type == RF_UNIT_QRP)
	{
		CALIBRATE.RFU_LPF_END = 60000 * 1000;		   //LPF
		CALIBRATE.RFU_HPF_START = 60000 * 1000;		   //HPF U14-RF1
		CALIBRATE.RFU_BPF_0_START = 135 * 1000 * 1000; //2m U14-RF3
		CALIBRATE.RFU_BPF_0_END = 150 * 1000 * 1000;   //2m
		CALIBRATE.RFU_BPF_1_START = 1500 * 1000;	   //160m U16-RF2
		CALIBRATE.RFU_BPF_1_END = 2400 * 1000;		   //160m
		CALIBRATE.RFU_BPF_2_START = 2400 * 1000;	   //80m U16-RF4
		CALIBRATE.RFU_BPF_2_END = 4700 * 1000;		   //80m
		CALIBRATE.RFU_BPF_3_START = 4700 * 1000;	   //40m U16-RF1
		CALIBRATE.RFU_BPF_3_END = 7200 * 1000;		   //40m
		CALIBRATE.RFU_BPF_4_START = 7200 * 1000;	   //30m U16-RF3
		CALIBRATE.RFU_BPF_4_END = 11500 * 1000;		   //30m
		CALIBRATE.RFU_BPF_5_START = 11500 * 1000;	   //20,17m U14-RF2
		CALIBRATE.RFU_BPF_5_END = 21000 * 1000;		   //20,17m
		CALIBRATE.RFU_BPF_6_START = 21000 * 1000;	   //15,12,10,6m U14-RF4
		CALIBRATE.RFU_BPF_6_END = 64000 * 1000;		   //15,12,10,6m
		CALIBRATE.RFU_BPF_7_START = 0;	   //disabled on qrp version
		CALIBRATE.RFU_BPF_7_END = 0;		   //disabled on qrp version
		CALIBRATE.RFU_BPF_8_START = 0;	   //disabled on qrp version
		CALIBRATE.RFU_BPF_8_END = 0;		   //disabled on qrp version
		CALIBRATE.RFU_BPF_9_START = 0;	   //disabled on qrp version
		CALIBRATE.RFU_BPF_9_END = 0;		   //disabled on qrp version
		CALIBRATE.SWR_FWD_Calibration_HF = 11.0f;	   //SWR Transormator rate forward
		CALIBRATE.SWR_REF_Calibration_HF = 11.0f;	   //SWR Transormator rate return
		CALIBRATE.SWR_FWD_Calibration_VHF = 3.6f;	   //SWR Transormator rate forward
		CALIBRATE.SWR_REF_Calibration_VHF = 3.6f;	   //SWR Transormator rate return
		CALIBRATE.TUNE_MAX_POWER = 2;			   // Maximum RF power in Tune mode
		CALIBRATE.MAX_RF_POWER = 7;				//Max TRX Power for indication
	}
	if(CALIBRATE.RF_unit_type == RF_UNIT_BIG)
	{
		CALIBRATE.RFU_LPF_END = 0;		   //disabled in BIG version
		CALIBRATE.RFU_HPF_START = 0;		   //disabled in BIG version
		CALIBRATE.RFU_BPF_1_START = 0 * 1000;	   //2200m
		CALIBRATE.RFU_BPF_1_END = 1000 * 1000;		   //2200m
		CALIBRATE.RFU_BPF_2_START = 1000 * 1000;	   //160m
		CALIBRATE.RFU_BPF_2_END = 2500 * 1000;		   //160m
		CALIBRATE.RFU_BPF_3_START = 2500 * 1000;	   //80m
		CALIBRATE.RFU_BPF_3_END = 5000 * 1000;		   //80m
		CALIBRATE.RFU_BPF_4_START = 5000 * 1000;	   //40m
		CALIBRATE.RFU_BPF_4_END = 8500 * 1000;		   //40m
		CALIBRATE.RFU_BPF_5_START = 8500 * 1000;	   //30m
		CALIBRATE.RFU_BPF_5_END = 12000 * 1000;		   //30m
		CALIBRATE.RFU_BPF_6_START = 12000 * 1000;	   //20m
		CALIBRATE.RFU_BPF_6_END = 17000 * 1000;		   //20m
		CALIBRATE.RFU_BPF_7_START = 17000 * 1000;	   //17,15,12m
		CALIBRATE.RFU_BPF_7_END = 25500 * 1000;		   //17,15,12m
		CALIBRATE.RFU_BPF_8_START = 25500 * 1000;	   //CB,10m
		CALIBRATE.RFU_BPF_8_END = 35000 * 1000;		   //CB,10m
		CALIBRATE.RFU_BPF_9_START = 35000 * 1000;	   //6m
		CALIBRATE.RFU_BPF_9_END = 70000 * 1000;		   //6m
		CALIBRATE.SWR_FWD_Calibration_HF = 22.0f;	   //SWR Transormator rate forward
		CALIBRATE.SWR_REF_Calibration_HF = 22.0f;	   //SWR Transormator rate return
		CALIBRATE.SWR_FWD_Calibration_VHF = 22.0f;	   //SWR Transormator rate forward
		CALIBRATE.SWR_REF_Calibration_VHF = 22.0f;	   //SWR Transormator rate return
		CALIBRATE.TUNE_MAX_POWER = 10;			   // Maximum RF power in Tune mode
		CALIBRATE.MAX_RF_POWER = 100;				//Max TRX Power for indication
	}
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_CALIBRATIONMENU(int8_t direction)
{
#pragma unused(direction)
	if (!SYSMENU_hiddenmenu_enabled)
		return;
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_calibration_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_calibration_handlers) / sizeof(sysmenu_calibration_handlers[0]);
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_SWR_Tandem_Ctrl(int8_t direction) //Tisho
{
#pragma unused(direction)
	if (SYSMENU_TDM_CTRL_opened)
	{
	}
	else
	{
		SYSMENU_TDM_CTRL_opened = true;
		TDM_Voltages_Start();
		//		drawSystemMenu(true);
	}
}

static void SYSMENU_HANDL_CALIB_CICCOMP_48K_SHIFT(int8_t direction)
{
	CALIBRATE.CICFIR_GAINER_48K_val += direction;
	if (CALIBRATE.CICFIR_GAINER_48K_val < 32)
		CALIBRATE.CICFIR_GAINER_48K_val = 32;
	if (CALIBRATE.CICFIR_GAINER_48K_val > 61)
		CALIBRATE.CICFIR_GAINER_48K_val = 61;
}

static void SYSMENU_HANDL_CALIB_CICCOMP_96K_SHIFT(int8_t direction)
{
	CALIBRATE.CICFIR_GAINER_96K_val += direction;
	if (CALIBRATE.CICFIR_GAINER_96K_val < 32)
		CALIBRATE.CICFIR_GAINER_96K_val = 32;
	if (CALIBRATE.CICFIR_GAINER_96K_val > 61)
		CALIBRATE.CICFIR_GAINER_96K_val = 61;
}

static void SYSMENU_HANDL_CALIB_CICCOMP_192K_SHIFT(int8_t direction)
{
	CALIBRATE.CICFIR_GAINER_192K_val += direction;
	if (CALIBRATE.CICFIR_GAINER_192K_val < 32)
		CALIBRATE.CICFIR_GAINER_192K_val = 32;
	if (CALIBRATE.CICFIR_GAINER_192K_val > 61)
		CALIBRATE.CICFIR_GAINER_192K_val = 61;
}

static void SYSMENU_HANDL_CALIB_CICCOMP_384K_SHIFT(int8_t direction)
{
	CALIBRATE.CICFIR_GAINER_384K_val += direction;
	if (CALIBRATE.CICFIR_GAINER_384K_val < 32)
		CALIBRATE.CICFIR_GAINER_384K_val = 32;
	if (CALIBRATE.CICFIR_GAINER_384K_val > 61)
		CALIBRATE.CICFIR_GAINER_384K_val = 61;
}

static void SYSMENU_HANDL_CALIB_TXCICCOMP_SHIFT(int8_t direction)
{
	CALIBRATE.TXCICFIR_GAINER_val += direction;
	if (CALIBRATE.TXCICFIR_GAINER_val < 16)
		CALIBRATE.TXCICFIR_GAINER_val = 16;
	if (CALIBRATE.TXCICFIR_GAINER_val > 48)
		CALIBRATE.TXCICFIR_GAINER_val = 48;
}

