witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_CALIB_DAC_SHIFT(int8_t direction)
{
	CALIBRATE.DAC_GAINER_val += direction;
	if (CALIBRATE.DAC_GAINER_val < 14)
		CALIBRATE.DAC_GAINER_val = 14;
	if (CALIBRATE.DAC_GAINER_val > 28)
		CALIBRATE.DAC_GAINER_val = 28;
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_2200M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_2200m > 0)
		CALIBRATE.rf_out_power_2200m += direction;
	if (CALIBRATE.rf_out_power_2200m == 0 && direction > 0)
		CALIBRATE.rf_out_power_2200m += direction;
	if (CALIBRATE.rf_out_power_2200m > 100)
		CALIBRATE.rf_out_power_2200m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_160M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_160m > 0)
		CALIBRATE.rf_out_power_160m += direction;
	if (CALIBRATE.rf_out_power_160m == 0 && direction > 0)
		CALIBRATE.rf_out_power_160m += direction;
	if (CALIBRATE.rf_out_power_160m > 100)
		CALIBRATE.rf_out_power_160m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_80M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_80m > 0)
		CALIBRATE.rf_out_power_80m += direction;
	if (CALIBRATE.rf_out_power_80m == 0 && direction > 0)
		CALIBRATE.rf_out_power_80m += direction;
	if (CALIBRATE.rf_out_power_80m > 100)
		CALIBRATE.rf_out_power_80m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_40M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_40m > 0)
		CALIBRATE.rf_out_power_40m += direction;
	if (CALIBRATE.rf_out_power_40m == 0 && direction > 0)
		CALIBRATE.rf_out_power_40m += direction;
	if (CALIBRATE.rf_out_power_40m > 100)
		CALIBRATE.rf_out_power_40m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_30M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_30m > 0)
		CALIBRATE.rf_out_power_30m += direction;
	if (CALIBRATE.rf_out_power_30m == 0 && direction > 0)
		CALIBRATE.rf_out_power_30m += direction;
	if (CALIBRATE.rf_out_power_30m > 100)
		CALIBRATE.rf_out_power_30m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_20M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_20m > 0)
		CALIBRATE.rf_out_power_20m += direction;
	if (CALIBRATE.rf_out_power_20m == 0 && direction > 0)
		CALIBRATE.rf_out_power_20m += direction;
	if (CALIBRATE.rf_out_power_20m > 100)
		CALIBRATE.rf_out_power_20m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_17M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_17m > 0)
		CALIBRATE.rf_out_power_17m += direction;
	if (CALIBRATE.rf_out_power_17m == 0 && direction > 0)
		CALIBRATE.rf_out_power_17m += direction;
	if (CALIBRATE.rf_out_power_17m > 100)
		CALIBRATE.rf_out_power_17m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_15M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_15m > 0)
		CALIBRATE.rf_out_power_15m += direction;
	if (CALIBRATE.rf_out_power_15m == 0 && direction > 0)
		CALIBRATE.rf_out_power_15m += direction;
	if (CALIBRATE.rf_out_power_15m > 100)
		CALIBRATE.rf_out_power_15m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_12M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_12m > 0)
		CALIBRATE.rf_out_power_12m += direction;
	if (CALIBRATE.rf_out_power_12m == 0 && direction > 0)
		CALIBRATE.rf_out_power_12m += direction;
	if (CALIBRATE.rf_out_power_12m > 100)
		CALIBRATE.rf_out_power_12m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_CB(int8_t direction)
{
	if (CALIBRATE.rf_out_power_cb > 0)
		CALIBRATE.rf_out_power_cb += direction;
	if (CALIBRATE.rf_out_power_cb == 0 && direction > 0)
		CALIBRATE.rf_out_power_cb += direction;
	if (CALIBRATE.rf_out_power_cb > 100)
		CALIBRATE.rf_out_power_cb = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_10M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_10m > 0)
		CALIBRATE.rf_out_power_10m += direction;
	if (CALIBRATE.rf_out_power_10m == 0 && direction > 0)
		CALIBRATE.rf_out_power_10m += direction;
	if (CALIBRATE.rf_out_power_10m > 100)
		CALIBRATE.rf_out_power_10m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_6M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_6m > 0)
		CALIBRATE.rf_out_power_6m += direction;
	if (CALIBRATE.rf_out_power_6m == 0 && direction > 0)
		CALIBRATE.rf_out_power_6m += direction;
	if (CALIBRATE.rf_out_power_6m > 100)
		CALIBRATE.rf_out_power_6m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
}

static void SYSMENU_HANDL_CALIB_RF_GAIN_2M(int8_t direction)
{
	if (CALIBRATE.rf_out_power_2m > 0)
		CALIBRATE.rf_out_power_2m += direction;
	if (CALIBRATE.rf_out_power_2m == 0 && direction > 0)
		CALIBRATE.rf_out_power_2m += direction;
	if (CALIBRATE.rf_out_power_2m > 100)
		CALIBRATE.rf_out_power_2m = 100;

	TRX_MAX_TX_Amplitude = getMaxTXAmplitudeOnFreq(CurrentVFO->Freq);
}

static void SYSMENU_HANDL_CALIB_S_METER_HF(int8_t direction)
{
	CALIBRATE.smeter_calibration_hf += direction;
	if (CALIBRATE.smeter_calibration_hf < -50)
		CALIBRATE.smeter_calibration_hf = -50;
	if (CALIBRATE.smeter_calibration_hf > 50)
		CALIBRATE.smeter_calibration_hf = 50;
}

static void SYSMENU_HANDL_CALIB_S_METER_VHF(int8_t direction)
{
	CALIBRATE.smeter_calibration_vhf += direction;
	if (CALIBRATE.smeter_calibration_vhf < -50)
		CALIBRATE.smeter_calibration_vhf = -50;
	if (CALIBRATE.smeter_calibration_vhf > 50)
		CALIBRATE.smeter_calibration_vhf = 50;
}

static void SYSMENU_HANDL_CALIB_ADC_OFFSET(int8_t direction)
{
	CALIBRATE.adc_offset += direction;
	if (CALIBRATE.adc_offset < -500)
		CALIBRATE.adc_offset = -500;
	if (CALIBRATE.adc_offset > 500)
		CALIBRATE.adc_offset = 500;
}

static void SYSMENU_HANDL_CALIB_LPF_END(int8_t direction)
{
	CALIBRATE.RFU_LPF_END += direction * 100000;
	if (CALIBRATE.RFU_LPF_END < 1)
		CALIBRATE.RFU_LPF_END = 1;
	if (CALIBRATE.RFU_LPF_END > 999999999)
		CALIBRATE.RFU_LPF_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_0_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_0_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_0_START < 1)
		CALIBRATE.RFU_BPF_0_START = 1;
	if (CALIBRATE.RFU_BPF_0_START > 999999999)
		CALIBRATE.RFU_BPF_0_START = 999999999;
}

