witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_CALIB_BPF_0_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_0_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_0_END < 1)
		CALIBRATE.RFU_BPF_0_END = 1;
	if (CALIBRATE.RFU_BPF_0_END > 999999999)
		CALIBRATE.RFU_BPF_0_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_1_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_1_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_1_START < 1)
		CALIBRATE.RFU_BPF_1_START = 1;
	if (CALIBRATE.RFU_BPF_1_START > 999999999)
		CALIBRATE.RFU_BPF_1_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_1_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_1_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_1_END < 1)
		CALIBRATE.RFU_BPF_1_END = 1;
	if (CALIBRATE.RFU_BPF_1_END > 999999999)
		CALIBRATE.RFU_BPF_1_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_2_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_2_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_2_START < 1)
		CALIBRATE.RFU_BPF_2_START = 1;
	if (CALIBRATE.RFU_BPF_2_START > 999999999)
		CALIBRATE.RFU_BPF_2_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_2_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_2_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_2_END < 1)
		CALIBRATE.RFU_BPF_2_END = 1;
	if (CALIBRATE.RFU_BPF_2_END > 999999999)
		CALIBRATE.RFU_BPF_2_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_3_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_3_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_3_START < 1)
		CALIBRATE.RFU_BPF_3_START = 1;
	if (CALIBRATE.RFU_BPF_3_START > 999999999)
		CALIBRATE.RFU_BPF_3_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_3_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_3_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_3_END < 1)
		CALIBRATE.RFU_BPF_3_END = 1;
	if (CALIBRATE.RFU_BPF_3_END > 999999999)
		CALIBRATE.RFU_BPF_3_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_4_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_4_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_4_START < 1)
		CALIBRATE.RFU_BPF_4_START = 1;
	if (CALIBRATE.RFU_BPF_4_START > 999999999)
		CALIBRATE.RFU_BPF_4_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_4_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_4_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_4_END < 1)
		CALIBRATE.RFU_BPF_4_END = 1;
	if (CALIBRATE.RFU_BPF_4_END > 999999999)
		CALIBRATE.RFU_BPF_4_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_5_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_5_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_5_START < 1)
		CALIBRATE.RFU_BPF_5_START = 1;
	if (CALIBRATE.RFU_BPF_5_START > 999999999)
		CALIBRATE.RFU_BPF_5_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_5_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_5_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_5_END < 1)
		CALIBRATE.RFU_BPF_5_END = 1;
	if (CALIBRATE.RFU_BPF_5_END > 999999999)
		CALIBRATE.RFU_BPF_5_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_6_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_6_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_6_START < 1)
		CALIBRATE.RFU_BPF_6_START = 1;
	if (CALIBRATE.RFU_BPF_6_START > 999999999)
		CALIBRATE.RFU_BPF_6_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_6_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_6_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_6_END < 1)
		CALIBRATE.RFU_BPF_6_END = 1;
	if (CALIBRATE.RFU_BPF_6_END > 999999999)
		CALIBRATE.RFU_BPF_6_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_7_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_7_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_7_START < 1)
		CALIBRATE.RFU_BPF_7_START = 1;
	if (CALIBRATE.RFU_BPF_7_START > 999999999)
		CALIBRATE.RFU_BPF_7_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_7_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_7_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_7_END < 1)
		CALIBRATE.RFU_BPF_7_END = 1;
	if (CALIBRATE.RFU_BPF_7_END > 999999999)
		CALIBRATE.RFU_BPF_7_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_8_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_8_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_8_START < 1)
		CALIBRATE.RFU_BPF_8_START = 1;
	if (CALIBRATE.RFU_BPF_8_START > 999999999)
		CALIBRATE.RFU_BPF_8_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_8_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_8_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_8_END < 1)
		CALIBRATE.RFU_BPF_8_END = 1;
	if (CALIBRATE.RFU_BPF_8_END > 999999999)
		CALIBRATE.RFU_BPF_8_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_9_START(int8_t direction)
{
	CALIBRATE.RFU_BPF_9_START += direction * 100000;
	if (CALIBRATE.RFU_BPF_9_START < 1)
		CALIBRATE.RFU_BPF_9_START = 1;
	if (CALIBRATE.RFU_BPF_9_START > 999999999)
		CALIBRATE.RFU_BPF_9_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_BPF_9_END(int8_t direction)
{
	CALIBRATE.RFU_BPF_9_END += direction * 100000;
	if (CALIBRATE.RFU_BPF_9_END < 1)
		CALIBRATE.RFU_BPF_9_END = 1;
	if (CALIBRATE.RFU_BPF_9_END > 999999999)
		CALIBRATE.RFU_BPF_9_END = 999999999;
}

static void SYSMENU_HANDL_CALIB_HPF_START(int8_t direction)
{
	CALIBRATE.RFU_HPF_START += direction * 100000;
	if (CALIBRATE.RFU_HPF_START < 1)
		CALIBRATE.RFU_HPF_START = 1;
	if (CALIBRATE.RFU_HPF_START > 999999999)
		CALIBRATE.RFU_HPF_START = 999999999;
}

static void SYSMENU_HANDL_CALIB_SWR_FWD_RATE_HF(int8_t direction)
{
	CALIBRATE.SWR_FWD_Calibration_HF += (float32_t)direction * 0.1f;
	if (CALIBRATE.SWR_FWD_Calibration_HF < 1.0f)
		CALIBRATE.SWR_FWD_Calibration_HF = 1.0f;
	if (CALIBRATE.SWR_FWD_Calibration_HF > 70.0f)
		CALIBRATE.SWR_FWD_Calibration_HF = 70.0f;
}

static void SYSMENU_HANDL_CALIB_SWR_REF_RATE_HF(int8_t direction)
{
	CALIBRATE.SWR_REF_Calibration_HF += (float32_t)direction * 0.1f;
	if (CALIBRATE.SWR_REF_Calibration_HF < 1.0f)
		CALIBRATE.SWR_REF_Calibration_HF = 1.0f;
	if (CALIBRATE.SWR_REF_Calibration_HF > 70.0f)
		CALIBRATE.SWR_REF_Calibration_HF = 70.0f;
}

static void SYSMENU_HANDL_CALIB_SWR_FWD_RATE_VHF(int8_t direction)
{
	CALIBRATE.SWR_FWD_Calibration_VHF += (float32_t)direction * 0.1f;
	if (CALIBRATE.SWR_FWD_Calibration_VHF < 1.0f)
		CALIBRATE.SWR_FWD_Calibration_VHF = 1.0f;
	if (CALIBRATE.SWR_FWD_Calibration_VHF > 70.0f)
		CALIBRATE.SWR_FWD_Calibration_VHF = 70.0f;
}

static void SYSMENU_HANDL_CALIB_SWR_REF_RATE_VHF(int8_t direction)
{
	CALIBRATE.SWR_REF_Calibration_VHF += (float32_t)direction * 0.1f;
	if (CALIBRATE.SWR_REF_Calibration_VHF < 1.0f)
		CALIBRATE.SWR_REF_Calibration_VHF = 1.0f;
	if (CALIBRATE.SWR_REF_Calibration_VHF > 70.0f)
		CALIBRATE.SWR_REF_Calibration_VHF = 70.0f;
}

static void SYSMENU_HANDL_CALIB_MAX_RF_POWER(int8_t direction)
{
	CALIBRATE.MAX_RF_POWER += direction;
	if (CALIBRATE.MAX_RF_POWER < 5)
		CALIBRATE.MAX_RF_POWER = 5;
	if (CALIBRATE.MAX_RF_POWER > 200)
		CALIBRATE.MAX_RF_POWER = 200;
}

