witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_CALIB_VCXO(int8_t direction)
{
	CALIBRATE.VCXO_correction += direction;
	if (CALIBRATE.VCXO_correction < -100)
		CALIBRATE.VCXO_correction = -100;
	if (CALIBRATE.VCXO_correction > 100)
		CALIBRATE.VCXO_correction = 100;
}
//Tisho
static void SYSMENU_HANDL_CALIB_FW_AD8307_SLP(int8_t direction)
{
	CALIBRATE.FW_AD8307_SLP += (float32_t)direction * 0.1f;
	if (CALIBRATE.FW_AD8307_SLP < 20.0f)
		CALIBRATE.FW_AD8307_SLP = 20.0f;
	if (CALIBRATE.FW_AD8307_SLP > 30.0f)
		CALIBRATE.FW_AD8307_SLP = 30.0f;
}

static void SYSMENU_HANDL_CALIB_FW_AD8307_OFFS(int8_t direction)
{
	CALIBRATE.FW_AD8307_OFFS += (float32_t)direction;
	if (CALIBRATE.FW_AD8307_OFFS < 0.1f)
		CALIBRATE.FW_AD8307_OFFS = 0.1f;
	if (CALIBRATE.FW_AD8307_OFFS > 4000.0f)
		CALIBRATE.FW_AD8307_OFFS = 4000.0f;
}

static void SYSMENU_HANDL_CALIB_BW_AD8307_SLP(int8_t direction)
{
	CALIBRATE.BW_AD8307_SLP += (float32_t)direction * 0.1f;
	if (CALIBRATE.BW_AD8307_SLP < 20.0f)
		CALIBRATE.BW_AD8307_SLP = 20.0f;
	if (CALIBRATE.BW_AD8307_SLP > 30.0f)
		CALIBRATE.BW_AD8307_SLP = 30.0f;
}

static void SYSMENU_HANDL_CALIB_BW_AD8307_OFFS(int8_t direction)
{
	CALIBRATE.BW_AD8307_OFFS += (float32_t)direction;
	if (CALIBRATE.BW_AD8307_OFFS < 0.1f)
		CALIBRATE.BW_AD8307_OFFS = 0.1f;
	if (CALIBRATE.BW_AD8307_OFFS > 4000.0f)
		CALIBRATE.BW_AD8307_OFFS = 4000.0f;
}
//end Tisho
static void SYSMENU_HANDL_CALIB_FAN_MEDIUM_START(int8_t direction)
{
	CALIBRATE.FAN_MEDIUM_START += direction;
	if (CALIBRATE.FAN_MEDIUM_START < 10)
		CALIBRATE.FAN_MEDIUM_START = 10;
	if (CALIBRATE.FAN_MEDIUM_START > 100)
		CALIBRATE.FAN_MEDIUM_START = 100;
}

static void SYSMENU_HANDL_CALIB_FAN_MEDIUM_STOP(int8_t direction)
{
	CALIBRATE.FAN_MEDIUM_STOP += direction;
	if (CALIBRATE.FAN_MEDIUM_STOP < 10)
		CALIBRATE.FAN_MEDIUM_STOP = 10;
	if (CALIBRATE.FAN_MEDIUM_STOP > (CALIBRATE.FAN_MEDIUM_START - 1))
		CALIBRATE.FAN_MEDIUM_STOP = CALIBRATE.FAN_MEDIUM_START - 1;
}

static void SYSMENU_HANDL_CALIB_FAN_FULL_START(int8_t direction)
{
	CALIBRATE.FAN_FULL_START += direction;
	if (CALIBRATE.FAN_FULL_START < 10)
		CALIBRATE.FAN_FULL_START = 10;
	if (CALIBRATE.FAN_FULL_START > 100)
		CALIBRATE.FAN_FULL_START = 100;
}

static void SYSMENU_HANDL_CALIB_TRX_MAX_RF_TEMP(int8_t direction)
{
	CALIBRATE.TRX_MAX_RF_TEMP += direction;
	if (CALIBRATE.TRX_MAX_RF_TEMP < 30)
		CALIBRATE.TRX_MAX_RF_TEMP = 30;
	if (CALIBRATE.TRX_MAX_RF_TEMP > 120)
		CALIBRATE.TRX_MAX_RF_TEMP = 120;
}

static void SYSMENU_HANDL_CALIB_TRX_MAX_SWR(int8_t direction)
{
	CALIBRATE.TRX_MAX_SWR += direction;
	if (CALIBRATE.TRX_MAX_SWR < 2)
		CALIBRATE.TRX_MAX_SWR = 2;
	if (CALIBRATE.TRX_MAX_SWR > 50)
		CALIBRATE.TRX_MAX_SWR = 50;
}

static void SYSMENU_HANDL_CALIB_FM_DEVIATION_SCALE(int8_t direction)
{
	CALIBRATE.FM_DEVIATION_SCALE += direction;
	if (CALIBRATE.FM_DEVIATION_SCALE < 1)
		CALIBRATE.FM_DEVIATION_SCALE = 1;
	if (CALIBRATE.FM_DEVIATION_SCALE > 20)
		CALIBRATE.FM_DEVIATION_SCALE = 20;
}

static void SYSMENU_HANDL_CALIB_AM_MODULATION_INDEX(int8_t direction)
{
	CALIBRATE.AM_MODULATION_INDEX += direction;
	if (CALIBRATE.AM_MODULATION_INDEX < 1)
		CALIBRATE.AM_MODULATION_INDEX = 1;
	if (CALIBRATE.AM_MODULATION_INDEX > 150)
		CALIBRATE.AM_MODULATION_INDEX = 150;
}

static void SYSMENU_HANDL_CALIB_TUNE_MAX_POWER(int8_t direction)
{
	CALIBRATE.TUNE_MAX_POWER += direction;
	if (CALIBRATE.TUNE_MAX_POWER < 1)
		CALIBRATE.TUNE_MAX_POWER = 1;
	if (CALIBRATE.TUNE_MAX_POWER > 120)
		CALIBRATE.TUNE_MAX_POWER = 120;
}

static void SYSMENU_HANDL_CALIB_RTC_CALIBRATION(int8_t direction)
{
	CALIBRATE.RTC_Calibration += direction;
	if (CALIBRATE.RTC_Calibration < -511)
		CALIBRATE.RTC_Calibration = -511;
	if (CALIBRATE.RTC_Calibration > 511)
		CALIBRATE.RTC_Calibration = 511;

	RTC_Calibration();
}

static void SYSMENU_HANDL_CALIB_RTC_COARSE_CALIBRATION(int8_t direction)
{
	CALIBRATE.RTC_Coarse_Calibration += direction;
	if (CALIBRATE.RTC_Coarse_Calibration < 1)
		CALIBRATE.RTC_Coarse_Calibration = 1;
	if (CALIBRATE.RTC_Coarse_Calibration > 250)
		CALIBRATE.RTC_Coarse_Calibration = 250;

	RTC_Calibration();
}

static void SYSMENU_HANDL_CALIB_EXT_2200m(int8_t direction)
{
	if(CALIBRATE.EXT_2200m > 0 || direction > 0)
		CALIBRATE.EXT_2200m += direction;
	if (CALIBRATE.EXT_2200m > 15)
		CALIBRATE.EXT_2200m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_160m(int8_t direction)
{
	if(CALIBRATE.EXT_160m > 0 || direction > 0)
		CALIBRATE.EXT_160m += direction;
	if (CALIBRATE.EXT_160m > 15)
		CALIBRATE.EXT_160m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_80m(int8_t direction)
{
	if(CALIBRATE.EXT_80m > 0 || direction > 0)
		CALIBRATE.EXT_80m += direction;
	if (CALIBRATE.EXT_80m > 15)
		CALIBRATE.EXT_80m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_60m(int8_t direction)
{
	if(CALIBRATE.EXT_60m > 0 || direction > 0)
		CALIBRATE.EXT_60m += direction;
	if (CALIBRATE.EXT_60m > 15)
		CALIBRATE.EXT_60m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_40m(int8_t direction)
{
	if(CALIBRATE.EXT_40m > 0 || direction > 0)
		CALIBRATE.EXT_40m += direction;
	if (CALIBRATE.EXT_40m > 15)
		CALIBRATE.EXT_40m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_30m(int8_t direction)
{
	if(CALIBRATE.EXT_30m > 0 || direction > 0)
		CALIBRATE.EXT_30m += direction;
	if (CALIBRATE.EXT_30m > 15)
		CALIBRATE.EXT_30m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_20m(int8_t direction)
{
	if(CALIBRATE.EXT_20m > 0 || direction > 0)
		CALIBRATE.EXT_20m += direction;
	if (CALIBRATE.EXT_20m > 15)
		CALIBRATE.EXT_20m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_17m(int8_t direction)
{
	if(CALIBRATE.EXT_17m > 0 || direction > 0)
		CALIBRATE.EXT_17m += direction;
	if (CALIBRATE.EXT_17m > 15)
		CALIBRATE.EXT_17m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_15m(int8_t direction)
{
	if(CALIBRATE.EXT_15m > 0 || direction > 0)
		CALIBRATE.EXT_15m += direction;
	if (CALIBRATE.EXT_15m > 15)
		CALIBRATE.EXT_15m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_12m(int8_t direction)
{
	if(CALIBRATE.EXT_12m > 0 || direction > 0)
		CALIBRATE.EXT_12m += direction;
	if (CALIBRATE.EXT_12m > 15)
		CALIBRATE.EXT_12m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_CB(int8_t direction)
{
	if(CALIBRATE.EXT_CB > 0 || direction > 0)
		CALIBRATE.EXT_CB += direction;
	if (CALIBRATE.EXT_CB > 15)
		CALIBRATE.EXT_CB = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_10m(int8_t direction)
{
	if(CALIBRATE.EXT_10m > 0 || direction > 0)
		CALIBRATE.EXT_10m += direction;
	if (CALIBRATE.EXT_10m > 15)
		CALIBRATE.EXT_10m = 15;
}

