witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
static void SYSMENU_HANDL_CALIB_EXT_6m(int8_t direction)
{
	if(CALIBRATE.EXT_6m > 0 || direction > 0)
		CALIBRATE.EXT_6m += direction;
	if (CALIBRATE.EXT_6m > 15)
		CALIBRATE.EXT_6m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_FM(int8_t direction)
{
	if(CALIBRATE.EXT_FM > 0 || direction > 0)
		CALIBRATE.EXT_FM += direction;
	if (CALIBRATE.EXT_FM > 15)
		CALIBRATE.EXT_FM = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_2m(int8_t direction)
{
	if(CALIBRATE.EXT_2m > 0 || direction > 0)
		CALIBRATE.EXT_2m += direction;
	if (CALIBRATE.EXT_2m > 15)
		CALIBRATE.EXT_2m = 15;
}

static void SYSMENU_HANDL_CALIB_EXT_70cm(int8_t direction)
{
	if(CALIBRATE.EXT_70cm > 0 || direction > 0)
		CALIBRATE.EXT_70cm += direction;
	if (CALIBRATE.EXT_70cm > 15)
		CALIBRATE.EXT_70cm = 15;
}

static void SYSMENU_HANDL_CALIB_NOTX_NOTHAM(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_NOTHAM = true;
	if (direction < 0)
		CALIBRATE.NOTX_NOTHAM = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_2200m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_2200m = true;
	if (direction < 0)
		CALIBRATE.NOTX_2200m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_160m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_160m = true;
	if (direction < 0)
		CALIBRATE.NOTX_160m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_80m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_80m = true;
	if (direction < 0)
		CALIBRATE.NOTX_80m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_60m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_60m = true;
	if (direction < 0)
		CALIBRATE.NOTX_60m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_40m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_40m = true;
	if (direction < 0)
		CALIBRATE.NOTX_40m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_30m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_30m = true;
	if (direction < 0)
		CALIBRATE.NOTX_30m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_20m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_20m = true;
	if (direction < 0)
		CALIBRATE.NOTX_20m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_17m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_17m = true;
	if (direction < 0)
		CALIBRATE.NOTX_17m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_15m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_15m = true;
	if (direction < 0)
		CALIBRATE.NOTX_15m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_12m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_12m = true;
	if (direction < 0)
		CALIBRATE.NOTX_12m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_CB(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_CB = true;
	if (direction < 0)
		CALIBRATE.NOTX_CB = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_10m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_10m = true;
	if (direction < 0)
		CALIBRATE.NOTX_10m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_6m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_6m = true;
	if (direction < 0)
		CALIBRATE.NOTX_6m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_2m(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_2m = true;
	if (direction < 0)
		CALIBRATE.NOTX_2m = false;
}

static void SYSMENU_HANDL_CALIB_NOTX_70cm(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.NOTX_70cm = true;
	if (direction < 0)
		CALIBRATE.NOTX_70cm = false;
}

static void SYSMENU_HANDL_CALIB_ENABLE_60m_band(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.ENABLE_60m_band = true;
	if (direction < 0)
		CALIBRATE.ENABLE_60m_band = false;
	
	BANDS[BANDID_60m].selectable = CALIBRATE.ENABLE_60m_band;
}

static void SYSMENU_HANDL_CALIB_ENABLE_marine_band(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.ENABLE_marine_band = true;
	if (direction < 0)
		CALIBRATE.ENABLE_marine_band = false;
	
	BANDS[BANDID_Marine].selectable = CALIBRATE.ENABLE_marine_band;
}

static void SYSMENU_HANDL_CALIB_OTA_update(int8_t direction)
{
	if (direction > 0)
		CALIBRATE.OTA_update = true;
	if (direction < 0)
		CALIBRATE.OTA_update = false;
}

static void SYSMENU_HANDL_CALIB_TX_StartDelay(int8_t direction)
{
	if(CALIBRATE.TX_StartDelay > 0 || direction > 0)
		CALIBRATE.TX_StartDelay += direction;
	if (CALIBRATE.TX_StartDelay > 200)
		CALIBRATE.TX_StartDelay = 200;
}

//SERVICES
void SYSMENU_HANDL_SERVICESMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_services_opened = true;
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_services_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_services_handlers) / sizeof(sysmenu_services_handlers[0]);
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	//drawSystemMenu(true);
	LCD_redraw(false);
}

//SPECTRUM ANALIZER
static void SYSMENU_HANDL_SPECTRUMMENU(int8_t direction)
{
#pragma unused(direction)
	sysmenu_handlers_selected = (struct sysmenu_item_handler *)&sysmenu_spectrum_handlers[0];
	sysmenu_item_count = sizeof(sysmenu_spectrum_handlers) / sizeof(sysmenu_spectrum_handlers[0]);
	sysmenu_onroot = false;
	systemMenuIndex = 0;
	LCD_UpdateQuery.SystemMenuRedraw = true;
}

static void SYSMENU_HANDL_SPECTRUM_Start(int8_t direction)
{
	if (SYSMENU_spectrum_opened)
	{
		SPEC_EncRotate(direction);
	}
	else
	{
		SYSMENU_spectrum_opened = true;
		SPEC_Start();
		LCD_UpdateQuery.SystemMenuRedraw = true;
	}
}

static void SYSMENU_HANDL_SPECTRUM_Begin(int8_t direction)
{
	TRX.SPEC_Begin += direction * 100;
	if (TRX.SPEC_Begin < 100)
		TRX.SPEC_Begin = 100;
}

static void SYSMENU_HANDL_SPECTRUM_End(int8_t direction)
{
	TRX.SPEC_End += direction * 100;
	if (TRX.SPEC_End < 100)
		TRX.SPEC_End = 100;
}

static void SYSMENU_HANDL_SPECTRUM_TopDBM(int8_t direction)
{
	TRX.SPEC_TopDBM += direction;
	if (TRX.SPEC_TopDBM < -140)
		TRX.SPEC_TopDBM = -140;
	if (TRX.SPEC_TopDBM > 40)
		TRX.SPEC_TopDBM = 40;
	if (TRX.SPEC_TopDBM <= TRX.SPEC_BottomDBM)
		TRX.SPEC_TopDBM = TRX.SPEC_BottomDBM + 1;
}

static void SYSMENU_HANDL_SPECTRUM_BottomDBM(int8_t direction)
{
	TRX.SPEC_BottomDBM += direction;
	if (TRX.SPEC_BottomDBM < -140)
		TRX.SPEC_BottomDBM = -140;
	if (TRX.SPEC_BottomDBM > 40)
		TRX.SPEC_BottomDBM = 40;
	if (TRX.SPEC_BottomDBM >= TRX.SPEC_TopDBM)
		TRX.SPEC_BottomDBM = TRX.SPEC_TopDBM - 1;
}

