witalis3/UA3REO-DDC-Transceiver/STM32/Src/system_menu.c
void SYSMENU_redrawCurrentItem(void)
{
	sysmenu_i = SYSTMENU_getVisibleIdFromReal(systemMenuIndex);
	sysmenu_y = 5 + SYSTMENU_getVisibleIdFromReal(systemMenuIndex) * LAYOUT->SYSMENU_ITEM_HEIGHT;
	drawSystemMenuElement(&sysmenu_handlers_selected[systemMenuIndex], true);
}

static void drawSystemMenuElement(struct sysmenu_item_handler *menuElement, bool onlyVal)
{
	if(menuElement->checkVisibleHandler != NULL && !menuElement->checkVisibleHandler())
		return;
	char ctmp[32] = {0};
	if (!onlyVal)
	{
		LCDDriver_Fill_RectXY(0, sysmenu_y, LAYOUT->SYSMENU_W, sysmenu_y + 17, BG_COLOR);
		LCDDriver_printText(menuElement->title, LAYOUT->SYSMENU_X1, sysmenu_y, FG_COLOR, BG_COLOR, 2);
	}

	uint16_t x_pos = LAYOUT->SYSMENU_X2 - 5 * 12;
	float32_t tmp_float = 0;
	switch (menuElement->type)
	{
	case SYSMENU_UINT8:
		sprintf(ctmp, "%d", (uint8_t)*menuElement->value);
		break;
	case SYSMENU_B4:
		sprintf(ctmp, "%d%d%d%d", bitRead((uint8_t)*menuElement->value, 3), bitRead((uint8_t)*menuElement->value, 2), bitRead((uint8_t)*menuElement->value, 1), bitRead((uint8_t)*menuElement->value, 0));
		break;
	case SYSMENU_ENUM:
		sprintf(ctmp, "%s", menuElement->enumerate[(uint8_t)*menuElement->value]);
		break;
	case SYSMENU_ENUMR:
		sprintf(ctmp, "%s", menuElement->enumerate[(uint8_t)*menuElement->value]);
		break;
	case SYSMENU_UINT16:
		sprintf(ctmp, "%d", (uint16_t)*menuElement->value);
		break;
	case SYSMENU_UINT32:
		sprintf(ctmp, "%u", (uint32_t)*menuElement->value);
		break;
	case SYSMENU_UINT32R:
		sprintf(ctmp, "%u", (uint32_t)*menuElement->value);
		break;
	case SYSMENU_INT8:
		sprintf(ctmp, "%d", (int8_t)*menuElement->value);
		break;
	case SYSMENU_INT16:
		sprintf(ctmp, "%d", (int16_t)*menuElement->value);
		break;
	case SYSMENU_INT32:
		sprintf(ctmp, "%d", (int32_t)*menuElement->value);
		break;
	case SYSMENU_FLOAT32:
		dma_memcpy(&tmp_float, menuElement->value, sizeof(float32_t));
		sprintf(ctmp, "%.2f", (double)tmp_float);
		break;
	case SYSMENU_BOOLEAN:
		sprintf(ctmp, "%d", (int8_t)*menuElement->value);
		if ((uint8_t)*menuElement->value == 1)
			sprintf(ctmp, "YES");
		else
			sprintf(ctmp, "NO");
		break;
	case SYSMENU_RUN:
		sprintf(ctmp, "RUN");
		break;
	case SYSMENU_MENU:
		sprintf(ctmp, "->");
		break;
	case SYSMENU_INFOLINE:
		break;
	case SYSMENU_FUNCBUTTON:
		sprintf(ctmp, "%s", (char *)PERIPH_FrontPanel_FuncButtonsList[TRX.FuncButtons[(uint8_t)*menuElement->value]].name);
		break;
	}

	if (menuElement->type != SYSMENU_INFOLINE)
	{
		addSymbols(ctmp, ctmp, ENUM_MAX_LENGTH, " ", false);
		LCDDriver_printText(ctmp, x_pos, sysmenu_y, FG_COLOR, BG_COLOR, 2);
	}

	if (SYSTMENU_getVisibleIdFromReal(systemMenuIndex) == sysmenu_i)
	{
		if (sysmenu_item_selected_by_enc2)
			LCDDriver_drawFastHLine(0, sysmenu_y + 17, LAYOUT->SYSMENU_W, COLOR->BUTTON_TEXT);
		else
			LCDDriver_drawFastHLine(0, sysmenu_y + 17, LAYOUT->SYSMENU_W, FG_COLOR);
	}
	sysmenu_i++;
	sysmenu_y += LAYOUT->SYSMENU_ITEM_HEIGHT;
}

static uint8_t SYSTMENU_getVisibleIdFromReal(uint8_t realIndex)
{
	uint8_t visible = 0;
	for(uint8_t i = 0; i < systemMenuIndex; i++)
	{
		if(sysmenu_handlers_selected[i].checkVisibleHandler == NULL || sysmenu_handlers_selected[i].checkVisibleHandler())
		{
			visible++;
			if(visible >= LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE)
			{
				visible = 0;
			}
		}
	}
	return visible;
}

static uint8_t SYSTMENU_getPageFromRealIndex(uint8_t realIndex)
{
	uint8_t visible = 0;
	uint8_t page = 0;
	for(uint8_t i = 0; i < systemMenuIndex; i++)
	{
		if(sysmenu_handlers_selected[i].checkVisibleHandler == NULL || sysmenu_handlers_selected[i].checkVisibleHandler())
		{
			visible++;
			if(visible >= LAYOUT->SYSMENU_MAX_ITEMS_ON_PAGE)
			{
				visible = 0;
				page++;
			}
		}
	}
	return page;
}

static bool SYSMENU_HANDL_CHECK_RFU_QRP(void)
{
	return (CALIBRATE.RF_unit_type == RF_UNIT_QRP);
}

static bool SYSMENU_HANDL_CHECK_RFU_BIG(void)
{
	return (CALIBRATE.RF_unit_type == RF_UNIT_BIG);
}

static bool SYSMENU_HANDL_CHECK_RFU_ATU(void)
{
	return (CALIBRATE.RF_unit_type == RF_UNIT_BIG);
}

static bool SYSMENU_HANDL_CHECK_HIDDEN_ENABLED(void)
{
	return SYSMENU_hiddenmenu_enabled;
}
